//**************************************************************************** S
//
//	 ヘッダー名称	:	map.h
//
//==============================================================================
//	 コメント		:	map.cの為の関数ヘッダー
//	 最終更新日		:	2002/11/29 (Fri)
//**************************************************************************** E

#ifndef		___MAP_H___
#define		___MAP_H___


void MakeMap( const u16 *, u16, u16, u8 );	// マップデータの作成と転送
	// 無し ( 転送元アドレス, 縦最大キャラ数, 横最大キャラ数, 背景No )

void ClearMapData( u8 );					// マップデータの0クリア
	// 無し ( 背景No )


#endif	// #ifndef	___MAP_H___
