//**************************************************************************** S
//
//	 ソース名称		:	macro.h
//
//==============================================================================
//	 コメント		:	自作のマクロヘッダー
//	 最終更新日		:	  2002/10/31 (Thu)
//**************************************************************************** E

// ------- ±の符号を返すマクロ -------
#define		Sign( num )		( ( (num) < 0 ) ? -1 : ( (num)? 1 : 0 ) )

// ------- 絶対値を返すマクロ ------
#define		Abs( num )		( ( (num) < 0 ) ? -(num) : (num) )

// ------- 比較して小さい値を返すマクロ -------
#define		Min( a, b )		( ( (a) < (b) ) ? (a) : (b) )

// ------- 比較して大きい値を返すマクロ -------
#define		Max( a, b )		( ( (a) > (b) ) ? (a) : (b) )

// ------- 値を入れ替えるマクロ -------
#define		Swap( a, b )	{ (b)=(a)^(b); (a)=(a)^(b); (b)=(a)^(b); }

// ------- サインの値を返すマクロ ------- 
#define		Sin( num )		c_SinTbl[num]

// ------- コサインの値を返すマクロ ------- 
#define		Cos( num )		c_SinTbl[(num)+64]

//*****************************************************************************S
//	 マクロ名	:	HitSquare
//	   機能		:	四角形と四角形のあたり判定。当たれば真、当たらなければ偽
//	  引数 1	:	1つ目の四角形の情報をもつHIT_TYPE構造体
//	  引数 2	:	2つ目の四角形の情報をもつHIT_TYPE構造体
//	  戻り値	:	当たるなら真、当たらないなら偽
//------------------------------------------------------------------------------
//	 コメント	:	関数化しても問題ないが、実行速度をあげるためにマクロ化
//					if文の条件式として入れて使用する方法がメイン
//					wid か hei に0を入れることにより、「線」の当たり判定に
//	最終更新日	:	2002/10 /31 (Thu)
//==============================================================================
#define	HitSquare( Square1, Square2 )																			\
	( ( (Square1.x)+( Hoffset>>16 ) >= ( EnemyNowstatus[EnemyNo].x>>16 ) - (Square1.wid) - HERO_CENTER_X ) &&	\
	  ( (Square1.y)+( Voffset>>16 ) >= ( EnemyNowstatus[EnemyNo].y>>16 ) - (Square1.hei) - HERO_CENTER_Y ) &&	\
	  ( (Square1.x)+( Hoffset>>16 ) <  ( EnemyNowstatus[EnemyNo].x>>16 ) + (Square2.wid) - HERO_CENTER_X ) &&	\
	  ( (Square1.y)+( Voffset>>16 ) <  ( EnemyNowstatus[EnemyNo].y>>16 ) + (Square2.hei) - HERO_CENTER_Y ) )
//*****************************************************************************E


//*****************************************************************************S
//	 マクロ名	:	HitSquare2
//	   機能		:	上のマクロの魔法弾用
//	  引数 1	:	1つ目の四角形の情報をもつHIT_TYPE構造体
//	  引数 2	:	2つ目の四角形の情報をもつHIT_TYPE構造体
//	  戻り値	:	当たるなら真、当たらないなら偽
//------------------------------------------------------------------------------
//	 コメント	:	関数化しても問題ないが、実行速度をあげるためにマクロ化
//					if文の条件式として入れて使用する方法がメイン
//					wid か hei に0を入れることにより、「線」の当たり判定に
//	最終更新日	:	2002/10 /31 (Thu)
//==============================================================================
#define	HitSquare2( Square1, Square2 )																					\
	( ( (Square1.x)+( PlayerMagic[0].x>>16 ) >= ( EnemyNowstatus[EnemyNo].x>>16 ) - (Square1.wid) - HERO_CENTER_X ) &&	\
	  ( (Square1.y)+( PlayerMagic[0].y>>16 ) >= ( EnemyNowstatus[EnemyNo].y>>16 ) - (Square1.hei) - HERO_CENTER_Y ) &&	\
	  ( (Square1.x)+( PlayerMagic[0].x>>16 ) <  ( EnemyNowstatus[EnemyNo].x>>16 ) + (Square2.wid) - HERO_CENTER_X ) &&	\
	  ( (Square1.y)+( PlayerMagic[0].y>>16 ) <  ( EnemyNowstatus[EnemyNo].y>>16 ) + (Square2.hei) - HERO_CENTER_Y ) )
//*****************************************************************************E


//*****************************************************************************S
//	 マクロ名	:	HitSquare3
//	   機能		:	上のマクロの魔法弾用
//	  引数 1	:	1つ目の四角形の情報をもつHIT_TYPE構造体
//	  引数 2	:	2つ目の四角形の情報をもつHIT_TYPE構造体
//	  戻り値	:	当たるなら真、当たらないなら偽
//------------------------------------------------------------------------------
//	 コメント	:	関数化しても問題ないが、実行速度をあげるためにマクロ化
//					if文の条件式として入れて使用する方法がメイン
//					wid か hei に0を入れることにより、「線」の当たり判定に
//	最終更新日	:	2002/10 /31 (Thu)
//==============================================================================
#define	HitSquare3( Square1, Square2 )																					\
	( ( (Square2.x)+( PlayerNowstatus[0].x>>16 ) >= ( EnemyNowstatus[EnemyNo].x>>16 ) - (Square2.wid) - HERO_CENTER_X ) &&	\
	  ( (Square2.y)+( PlayerNowstatus[0].y>>16 ) >= ( EnemyNowstatus[EnemyNo].y>>16 ) - (Square2.hei) - HERO_CENTER_Y ) &&	\
	  ( (Square2.x)+( PlayerNowstatus[0].x>>16 ) < ( EnemyNowstatus[EnemyNo].x>>16 ) + (Square1.wid) - HERO_CENTER_X ) &&	\
	  ( (Square2.y)+( PlayerNowstatus[0].y>>16 ) < ( EnemyNowstatus[EnemyNo].y>>16 ) + (Square1.hei) - HERO_CENTER_Y ) )
//*****************************************************************************E


//*****************************************************************************S
//	 マクロ名	:	HitSquare4
//	   機能		:	上のマクロの魔法弾用
//	  引数 1	:	1つ目の四角形の情報をもつHIT_TYPE構造体
//	  引数 2	:	2つ目の四角形の情報をもつHIT_TYPE構造体
//	  戻り値	:	当たるなら真、当たらないなら偽
//------------------------------------------------------------------------------
//	 コメント	:	関数化しても問題ないが、実行速度をあげるためにマクロ化
//					if文の条件式として入れて使用する方法がメイン
//					wid か hei に0を入れることにより、「線」の当たり判定に
//	最終更新日	:	2002/10 /31 (Thu)
//==============================================================================
#define	HitSquare4( Square1, Square2 )																					\
	( ( (Square2.x)+( PlayerNowstatus[0].x>>16 ) >= ( EnemyMagic[EnemyNo].x>>16 ) - (Square2.wid) - HERO_CENTER_X ) &&	\
	  ( (Square2.y)+( PlayerNowstatus[0].y>>16 ) >= ( EnemyMagic[EnemyNo].y>>16 ) - (Square2.hei) - HERO_CENTER_Y ) &&	\
	  ( (Square2.x)+( PlayerNowstatus[0].x>>16 ) < ( EnemyMagic[EnemyNo].x>>16 ) + (Square1.wid) - HERO_CENTER_X ) &&	\
	  ( (Square2.y)+( PlayerNowstatus[0].y>>16 ) < ( EnemyMagic[EnemyNo].y>>16 ) + (Square1.hei) - HERO_CENTER_Y ) )
//*****************************************************************************E


//*****************************************************************************S
//	 マクロ名	:	HitSquare5
//	   機能		:	上のマクロの魔法弾用
//	  引数 1	:	1つ目の四角形の情報をもつHIT_TYPE構造体
//	  引数 2	:	2つ目の四角形の情報をもつHIT_TYPE構造体
//	  戻り値	:	当たるなら真、当たらないなら偽
//------------------------------------------------------------------------------
//	 コメント	:	関数化しても問題ないが、実行速度をあげるためにマクロ化
//					if文の条件式として入れて使用する方法がメイン
//					wid か hei に0を入れることにより、「線」の当たり判定に
//	最終更新日	:	2002/10 /31 (Thu)
//==============================================================================
#define	HitSquare5( Square1, Square2 )																					\
	( ( (Square2.x)+( PlayerNowstatus[0].x>>16 ) >= ( Coin[EnemyNo].x>>16 ) - (Square2.wid) - HERO_CENTER_X ) &&	\
	  ( (Square2.y)+( PlayerNowstatus[0].y>>16 ) >= ( Coin[EnemyNo].y>>16 ) - (Square2.hei) - HERO_CENTER_Y ) &&	\
	  ( (Square2.x)+( PlayerNowstatus[0].x>>16 ) < ( Coin[EnemyNo].x>>16 ) + (Square1.wid) - HERO_CENTER_X ) &&	\
	  ( (Square2.y)+( PlayerNowstatus[0].y>>16 ) < ( Coin[EnemyNo].y>>16 ) + (Square1.hei) - HERO_CENTER_Y ) )
//*****************************************************************************E
