//*****************************************************************************S
//							ハードウェア初期化など
//	tab		4
//	Copyright (C)	コンピュータ総合学園 HAL
//*****************************************************************************E

#include <agb.h>
#include "hard_init.h"

//******************************** 初期化関連 *********************************S
//*********************************************************S
//	全ＲＡＭ領域の初期化
void ClearRamAll( void )
{
	// プログラム実行開始時にはウェイトコントロール設定値が 000 に初期化されています。
	// 使用しているＲＯＭに適したウェイトを一度だけセットします。
	// 3-1ウェイトアクセス設定
	*(vu16 *)REG_WAITCNT = CST_ROM0_1ST_3WAIT | CST_ROM0_2ND_1WAIT | CST_PREFETCH_ENABLE;
	ClearWorkRam();
	ClearGraphicRam();
}
//*********************************************************E

//*********************************************************S
//	ワークＲＡＭの初期化
void ClearWorkRam( void )
{
	DmaClear(3, 0, EX_WRAM,  EX_WRAM_SIZE,          32);	// CPU外部ワークRAM クリア
	DmaClear(3, 0, CPU_WRAM, CPU_WRAM_SIZE - 0x200, 32);	// CPU内部ワークRAM クリア
}
//*********************************************************E

//*********************************************************S
//	グラフィック関係のRAM初期化
void ClearGraphicRam( void )
{
	ClearVram();
	ClearOamRam();
	ClearPaletteRam();
}
//*********************************************************E

//*********************************************************S
//	ＶＲＡＭの初期化
void ClearVram( void )
{
	DmaClear(3, 0, VRAM, VRAM_SIZE, 16);
}
//*********************************************************E

//*********************************************************S
//	ＯＡＭの初期化
void ClearOamRam( void )
{
  register int	i;
  register u32	*oam_ptr;
	oam_ptr = (u32 *)OAM;
	for( i = 0; i < 32; i++ )
	{
		*oam_ptr++ = OAM_OBJ_OFF;
		*oam_ptr++ = 0x00000100;
		*oam_ptr++ = OAM_OBJ_OFF;
		*oam_ptr++ = 0x00000000;
		*oam_ptr++ = OAM_OBJ_OFF;
		*oam_ptr++ = 0x00000000;
		*oam_ptr++ = OAM_OBJ_OFF;
		*oam_ptr++ = 0x00000100;
	}
}
//*********************************************************E

//*********************************************************S
//	パレットVRAM初期化
void ClearPaletteRam( void )
{
	DmaClear(3, 0, PLTT, PLTT_SIZE, 16);
}
//*********************************************************E



/*==================================================================*/
/*			  割り込みルーチン（処理をできるだけ軽くする）		*/
/*==================================================================*/

/*------------------------------------------------------------------*/
/*					  Ｖブランク処理							  */
/*------------------------------------------------------------------*/

void VBlankIntr(void)
{
}

/*------------------------------------------------------------------*/
/*					  割り込み ダミールーチン					 */
/*------------------------------------------------------------------*/

void IntrDummy(void)
{
}

