/************************************************************
*						DATA.H								*
*															*
*		このファイルでは、テーブルデータ定義をします。		*
*															*
*															*
************************************************************/

//-----Xファイルの名前定義配列-----------------
char* file_name_x[] = {
	".\\model\\chr.x",
	".\\model\\enemy.x",
	".\\model\\yuka.x",
	".\\model\\yuka2.x",
	".\\model\\yuka3.x",
};

XFILEINFO xfileinfo[] = {
	{"model/body_0.x", "model/texture.bmp"},		// 0
	{"model/body_1.x", "model/texture.bmp"},		// 1
	{"model/head.x",   "model/texture.bmp"},		// 2
	{"model/arm_0.x",  "model/texture.bmp"},		// 3
	{"model/arm_1.x",  "model/texture.bmp"},		// 4
	{"model/arm_2.x",  "model/texture.bmp"},		// 5
	{"model/leg_0.x",  "model/texture.bmp"},		// 6
	{"model/leg_1.x",  "model/texture.bmp"},		// 7
	{"model/leg_2.x",  "model/texture.bmp"},		// 8
};
PARTSINFO partsinfo[] = {
	//      model         parent    px    py    pz  rotx  roty  rotz
	{MODEL_BODY_0,            -1,    0,    0,    0,    0,    0,    0},	// 0
	{MODEL_BODY_1, PARTS_BODY_0 ,    0,  100,    0,    0,    0,    0},	// 1
	{MODEL_HEAD  , PARTS_BODY_1 ,    0,  110,    0,    0,	 0,    0},	// 2
	{MODEL_ARM_0 , PARTS_BODY_1 ,  130,  100,    0,    0,    0,    0},	// 3
	{MODEL_ARM_1 , PARTS_R_ARM_0,    0, -100,    0,    0,    0,    0},	// 4
	{MODEL_ARM_2 , PARTS_R_ARM_1,    0, -100,    0,    0,    0,    0},	// 5
	{MODEL_ARM_0 , PARTS_BODY_1 , -130,  100,    0,    0,    0,    0},	// 6
	{MODEL_ARM_1 , PARTS_L_ARM_0,    0, -100,    0,    0,    0,    0},	// 7
	{MODEL_ARM_2 , PARTS_L_ARM_1,    0, -100,    0,    0,    0,    0},	// 8
	{MODEL_LEG_0 , PARTS_BODY_0 ,   70,   30,    0,    0,    0,    0},	// 9
	{MODEL_LEG_1 , PARTS_R_LEG_0,    0, -120,    0,    0,    0,    0},	// 10
	{MODEL_LEG_2 , PARTS_R_LEG_1,    0, -150,    0,    0,    0,    0},	// 11
	{MODEL_LEG_0 , PARTS_BODY_0 ,  -70,   30,    0,    0,    0,    0},	// 12
	{MODEL_LEG_1 , PARTS_L_LEG_0,    0, -120,    0,    0,    0,    0},	// 13
	{MODEL_LEG_2 , PARTS_L_LEG_1,    0, -150,    0,    0,    0,    0},	// 14
};

//-----メッシュファイルの名前定義配列----------
char* file_name_bg_mesh[] = {
	".\\texture\\Effect1.tga",
	".\\texture\\Effect2.tga",
	".\\texture\\Title.tga",
	".\\texture\\Option.tga",
	".\\texture\\hp.bmp",
	".\\texture\\gard.bmp",
	".\\texture\\land.bmp",
	".\\texture\\GameOver.tga",
	".\\texture\\GameClear.tga",
	".\\texture\\Other.tga",
	".\\texture\\shadow.tga",
	".\\texture\\Score.tga",

};


//-----ＢＧＭファイルの名前定義配列----------
WCHAR* BGMFileName[] = {
		L"./sound/title.wav",
		L"./sound/stage.wav",
		L"./sound/bgm0.wav",
		L"./sound/db2.wav",
};


//-----効果音ファイルの名前定義配列----------
WCHAR* SoundFileName[] = {
		L"./sound/shot.wav",
		L"./sound/menu.wav",
		L"./sound/shot0.wav",
		L"./sound/shot1.wav",
		L"./sound/tama1.wav",
};


/****** 初期パラメータ値設定用構造体定義 *****************************

typedef struct {
	float	x,y,z;					// 初期座標
	float	rotx,roty,rotz;			// 初期角度
	int		move_pat_no;			// 移動パターンNo
	int		hp;						// 体力
	int		bllit_max;				// 弾の最大数
	int		bllit_pat_no;			// 弾のパターンNo
	int		status;					// 初期状態の設定フラグ
}DEF_PARAM;


*********************************************************************/
DEF_PARAM	Def_Enemy[] = {
				{ -1600,  -300, 3000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ 1600,  -300, 5000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -3000,  -300, 9000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ 8000,  -300, 14000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -4000,  -300, 15000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ 10000,  -300, 5000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -8000,  -300,-11000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -8000,  -300, 14000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -8000,  -300, -11000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ 14000,  -300, 14000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -10000,  -300, -11000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},
				{ -10000,  -300, -11000, 0.0, 0.0, 0.0, 1, 100, 1, 0, 0},

};

/****** 移動値設定用構造体定義 ***************************************

//--- 移動値設定用構造体定義

typedef struct {
	float	ex,ey,ez;				// 移動する終点
	float	erotx,eroty,erotz;		// 回転する終点
	int		shoot_cnt;				// 攻撃するまでのカウント
	int		gard_cnt;				// 防御するまでのカウント
	int		move_cnt;				// 移動する時間(フレーム)
	int		status;					// その他状態変化のためのフラグ
}MOVE_OFFSET;

*********************************************************************/
MOVE_OFFSET Move_Offset_A[] = {
	{   0,   0,  0, 0.0, 0.0, 0.0, 0, 0,  0,99},
};

/****** 弾移動パターン設定用構造体定義 *******************************

//--- 弾移動パターン設定用構造体
typedef struct {
	float   speed;							// 弾の移動速度
	float	rotx,roty,rotz;					// 回転する値
	int		damage;							// 攻撃力
	int		status;							// その他状態変化のためのフラグ
}TAMA_DATA;

*********************************************************************/
TAMA_DATA	Tama_Type_All[] = {
				{ 0.0, 0.0, 0.0, 50, 0,200},
				{ 0.0, 0.0, 0.0, 30, 0,200},
			};

/****** 床初期データ設定用構造体定義 *******************************

//--- 床初期データ設定用構造体
typedef struct {
	float		x,y,z;						// 座標
	float		dx,dy,dz;					// 回転値
	float		drx,dry,drz;				// 回転用オフセット値
	int			model_no;					// モデルの配列参照番号
	int			texture_no;					// テクスチャーの配列参照番号
}YUKA_DATA;

*********************************************************************/

YUKA_DATA	Yuka_Data_Bottom[] = {
				{0,-500,-8000,0,0,0,0,0,0,3,6},
				{0,-500,0,0,0,0,0,0,0,2,6},
				{0,-500,8000,0,0,0,0,0,0,2,6},
				{0,-500,16000,0,0,0,0,0,0,2,6},
				{0,-500,24000,0,0,0,0,0,0,4,6},
};

/****** ビルボード初期データ設定用構造体定義 *************************

typedef struct {
	float		x,y,z;						// 座標
	float		rotx,roty,rotz;				// 回転値
	float		dx, dy, dz;					// 移動オフセット量
	int			num_vertex;					// 頂点数
	int			num_index;					// 面数
	int			texture_size_x;				// テクスチャーの横幅
	int			texture_size_y;				// テクスチャーの縦幅
	int			texture_no;					// テクスチャーの配列参照番号
	int			turn;						// 裏表フラグ
	int			kasan;						// 加算半透明フラグ
	float		alpha;						// アルファ値
	int			anime_max;					// アニメーションの最大数
	int			anime_frame;				// アニメーションのフレーム数
}BBORD_DATA;

*********************************************************************/
BBORD_DATA	Bbord_Data[] = {
				//-----Effect1.tga用
				{POS_NUMERAL1_X,POS_NUMERAL1_Y,0,0,0,0,0,0,0,4,2,512,512,0,1,0,1,ANIME_NUMERAL_MAX,ANIME_NUMERAL_FRAME},
				// 数字用(一桁目)
				{POS_NUMERAL2_X,POS_NUMERAL2_Y,0,0,0,0,0,0,0,4,2,512,512,0,1,0,1,ANIME_NUMERAL_MAX,ANIME_NUMERAL_FRAME},
				// 数字用(二桁目)
				{POS_NUMERAL3_X,POS_NUMERAL3_Y,0,0,0,0,0,0,0,4,2,512,512,0,1,0,1,ANIME_NUMERAL_MAX,ANIME_NUMERAL_FRAME},
				// 数字用(三桁目)
				{POS_BEAT_X,POS_BEAT_Y,0,0,0,0,0,0,0,4,2,512,512,0,1,0,1,0,0},										// Beat!!用
				{POS_FIRE_X,POS_FIRE_Y,0,0,0,0,0,0,0,4,2,512,512,0,1,1,0.4f,ANIME_FIRE_MAX,ANIME_FIRE_FRAME},		// 炎用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,0,0,0,1.0f,0,0},														// 薬きょう用

				//-----Effect2.tga用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,1,0,0,1.0f,0,0},														// 弾用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,1,0,1,0.4f,0,0},														// マズルフラッシュ用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,1,0,0,1.0f,0,0},														// 敵ヒット時のフラッシュ用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,1,0,0,1.0f,0,0},														// 血用

				//-----Title.tga用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,2,1,0,1.0f,0,0},														// タイトル絵用
				{POS_START_X,POS_START_Y,0,0,0,0,0,0,0,4,2,512,512,2,1,0,1.0f,0,0},									// start用
				{POS_OPTION_X,POS_OPTION_Y,0,0,0,0,0,0,0,4,2,512,512,2,1,0,1.0f,0,0},								// option用
				{POS_QUIT_X,POS_QUIT_Y,0,0,0,0,0,0,0,4,2,512,512,2,1,0,1.0f,0,0},									// quit用

				//-----Option.tga用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,3,1,0,1.0f,0,0},														// メイン絵用
				{POS_BLOOD_ON_X,POS_BLOOD_ON_Y,0,0,0,0,0,0,0,4,2,512,512,3,1,0,1.0f,0,0},							// on(blood)用
				{POS_BLOOD_OFF_X,POS_BLOOD_OFF_Y,0,0,0,0,0,0,0,4,2,512,512,3,1,0,1.0f,0,0},							// off(blood)用
				{POS_SHADOW_ON_X,POS_SHADOW_ON_Y,0,0,0,0,0,0,0,4,2,512,512,3,1,0,1.0f,0,0},							// on(shadow)用
				{POS_SHADOW_OFF_X,POS_SHADOW_OFF_Y,0,0,0,0,0,0,0,4,2,512,512,3,1,0,1.0f,0,0},						// off()用
				{POS_EXIT_X,POS_EXIT_Y,0,0,0,0,0,0,0,4,2,512,512,3,1,0,1.0f,0,0},									// exit用

				//-----hp.bmp用
				{POS_HP_X,POS_HP_Y,0,0,0,0,0,0,0,4,2,122,6,4,1,0,1.0f,0,0},														// メイン絵用
				
				//-----GameOver.tga用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,7,1,0,1.0f,0,0},														// GameOver用

				//-----GameClear.tga用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,8,1,0,1.0f,0,0},														// GameClear用

				//-----Other.tga用
				{POS_READY_X,500,0,0,0,0,0,0,0,4,2,512,512,9,1,0,1.0f,0,0},														// READY用
				{POS_GO_X,500,0,0,0,0,0,0,0,4,2,512,512,9,1,0,1.0f,0,0},														// GO!!用
				{POS_GAUGE_X,POS_GAUGE_Y,0,0,0,0,0,0,0,4,2,512,512,9,1,0,1.0f,0,0},														// READY用
				{POS_BAR_X,POS_BAR_Y,0,0,0,0,0,0,0,4,2,512,512,9,1,0,1.0f,0,0},														// GO!!用

				//-----Shadow.tga用
				{0,0,0,0,0,0,0,0,0,4,2,98,98,10,0,0,0.7f,0,0},														// GO!!用

				//-----Score.tga用
				{POS_SCORE_X,POS_SCORE_Y,0,0,0,0,0,0,0,4,2,512,512,11,1,0,1.0f,0,0},								// SCORE用
				{POS_TOTAL_X,POS_TOTAL_Y,0,0,0,0,0,0,0,4,2,512,512,11,1,0,1.0f,0,0},								// TITLE用
				{POS_MAXHIT_X,POS_MAXHIT_Y,0,0,0,0,0,0,0,4,2,512,512,11,1,0,1.0f,0,0},								// MAXHIT用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,11,1,0,1.0f,0,0},													// KAKE用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,11,1,0,1.0f,0,0},													// NUM用
				{0,0,0,0,0,0,0,0,0,4,2,512,512,11,1,0,1.0f,0,0},													// TIME用

				};

RECT		texture1_offset[] = {
				{467,18,507,66},	// 0
				{0,18,40,66},		// 1
				{51,18,91,66},		// 2
				{100,18,140,66},	// 3
				{153,18,193,66},	// 4
				{205,18,245,66},	// 5
				{258,18,298,66},	// 6
				{312,18,352,66},	// 7
				{363,18,403,66},	// 8
				{417,18,457,66},	// 9
				{0,0,1,1},			// 空白
				{147,72,254,108},	// Beat!!
				{0,216,146,397},	// 炎１
				{148,216,295,397},	// 炎２
				{304,216,450,397},	// 炎３
				{162,126,196,135},	// 薬きょう

};
RECT		texture2_offset[] = {
				{0,0,34,34},		// 弾
				{55,0,133,70},		// マズルフラッシュ
				{155,0,223,70},		// マズルフラッシュ2
				{0,73,16,90},		// 血
				{81,79,131,145},	// 火の粉
};

RECT		title_offset[] = {
				{0,0,359,287},		// タイトル絵
				{0,300,78,322},		// start
				{0,327,92,358},		// option
				{0,360,63,391},		// quit
};

RECT		option_offset[] = {
				{0,0,359,287},		// メイン絵
				{0,302,39,319},		// on
				{0,328,54,352},		// off
				{0,365,59,387},		// exit
};

RECT		gameover_offset= {0,0,359,287};

RECT		gameclear_offset= {0,0,359,287};
				
RECT		hp_offset = {0,0,122,6};// HPゲージ

RECT		other_offset [] = {
				{0,0,374,71},		// READY
				{0,74,224,156},		// GO!!
				{18,199,269,216},	// LIFEバー
				{0,252,288,305},	// LIFEゲージ

};

RECT		shadow_offset = {0,0,96,96};// HPゲージ

RECT		score_offset [] = {
				{12,108,33,137},	// 0
				{43,108,58,137},	// 1
				{70,108,92,137},	// 2
				{100,108,119,137},	// 3
				{129,108,150,137},	// 4
				{159,108,183,137},	// 5
				{190,108,213,137},	// 6
				{221,108,243,137},	// 7
				{248,108,272,137},	// 8
				{277,108,299,137},	// 9
				{7,22,140,60},		// SCORE
				{154,23,281,59},	// TOTAL
				{301,18,485,55},	// MAX HIT
				{324,106,353,133},	// ×
				{10,159,83,182},	// TIME
};

				
float		Jump_Offset[JUMP_MAX] = {750,750,750,500,500,250,250,200,200,100,100,100,100,50,50,0,0,0,0,
									 0,0,0,0,-50,-50,-100,-100,-100,-100,-200,-200,-250,-250,-500,-500,-750,-750,-750,};


