//*****************************************************************************S
//							構造体・列挙体　定義ファイル
//	tab		4
//	Copyright (C)	コンピュータ総合学園 HAL　AP-12B-132 No.51 宮脇 秀則
//*****************************************************************************E


//***************************** 構造体 ****************************************S


//----------------------------- ＯＢＪキャラクタ ------------------------------
typedef struct _oam_type{
	u16		attr0;				//アトリビュート０転送用
	u16		attr1;				//アトリビュート１転送用
	u16		attr2;				//アトリビュート２転送用
	u16		rot_para;			//回転・拡大・縮小パラメータ用
}OAM_TYPE;


//----------------------------- アニメテーブル参照用 ---------------------------
typedef struct _anime_table{
		u16	spright_no;			//アニメーション用のスプライト番号
		s16	x_pos_add;			//X座標加算値
		s16	y_pos_add;			//Y座標加算値
		u16	v_wait;				//Vブランク待ちカウンタ
		u16 spright_size;		//キャラクタサイズ
		u8	status;				//ステータス用
}ANIME_TABLE;


//----------------------------- キャラクターステータス用 -----------------------
typedef struct _character{
		u16	spright;			//スプライトナンバー
		s16	x_pos;				//X座標用
		s16	y_pos;				//Y座標用
		u16 size;				//キャラクタサイズ
		u16	status;				//キャラクターの行動ステータス
}CHARACTER;


//***************************** 構造体 *****************************************E



//***************************** 列挙体 *****************************************S

//----------------------------- キャラ移動パターン用 -----------------------
enum move_type {stop,right,left} move_status;		//0：停止状態、1：右移動、2：左移動


//----------------------------- キャラ攻撃パターン用 -----------------------
enum attack_type { stand_by,one,two,three,jump_atk} attack_status;	
													//0：待機状態、1：１撃目、2：2撃目、3：3撃目
													//4：ジャンプ攻撃


//----------------------------- キャラジャンプパターン用 -----------------------
enum jump_type {stand,crouch,jump} jump_status;		//0：立ち状態、2：屈み状態、3：ジャンプ状態
															


//***************************** 列挙体 *****************************************E
